package org.itstep.lesson4.loops;

import java.util.Scanner;

public class Hw7 {
    //Завдання 7
    // Користувач вводить з клавіатури літеру.
    // Програма має визначити,
    // в якій розкладці введена літера — латиницею або кирилицею.
    // Виведіть в консоль: слово «латиниця»,
    // якщо літера введена латиницею, або «кирилиця»,
    // якщо літера відноситься до кириличного алфавіту.
    // Якщо введено цифру, а не літеру, виведіть слово «цифра».
    // Якщо символ не відноситься а ні до літери, а ні до цифри,
    // виведіть фразу: «неможливо визначити».
    public static void main(String[] args) {


        Scanner sc = new Scanner(System.in);
        String str = sc.next();
        char ch = str.charAt(0);

        if(ch >= 'A' && ch <= 'Z' || ch >= 'a' && ch <= 'z'){

        }
    }
}
