package org.itstep.lesson15.book;

public class Task05Main {
    //Завдання 5: Реалізуйте клас «Книга». Збережіть у полях класу:
    // назву книги, ПІБ автора, рік видання, назву видавництва, жанр
    // книги, кількість сторінок. Реалізуйте конструктори і методи класу для
    // введення і виведення даних. Реалізуйте доступ до окремих полів через методи класу.
    // Використовуйте механізм перевантаження методів.

    public static void main(String[] args) {
        Book book = new Book();
        System.out.println(book);
    }
}
