package org.itstep.lesson26.practice;

import java.util.HashMap;
import java.util.Map;

public class Main {
//Створіть програму для роботи зі словником. Наприклад, англоіспанський,
// французько-німецький або інша мовна пара. Програма має:
//• надавати початкове введення даних для словника;
//• відображати слово та його переклади;
//• дозволяти додавати, змінювати, видаляти переклади слова;
//•дозволяти додавати, змінювати, видаляти слово;
//•відображати топ-10 найпопулярніших слів (визначаємо
//популярність спираючись на лічильник звернень);
//•відображати топ-10 найнепопулярніших слів (визначаємо
//непопулярність спираючись на лічильник звернень).

    public static void main(String[] args) {


    }



}
